module.exports = {
    semi: true, // Отключаем точки с запятой в конце строк
    tabWidth: 4,
    singleQuote: true, // Используем одинарные кавычки вместо двойных      // Используем 2 пробела для отступов
    useTabs: false, // Используем пробелы вместо табов
    printWidth: 80, // Максимальная длина строки 80 символов
    bracketSpacing: true, // Добавляем пробелы внутри фигурных скобок
    arrowParens: 'always', // Всегда оборачиваем аргументы стрелочных функций в скобки
    endOfLine: 'lf' // Используем LF окончание строк (для Unix-like систем)
};
